import { Link } from "react-router";

const PostContent = () => {
  const PostData = {
    Id: 1,
    Title: "طرح مجلس برای گرفتن مالیات از سفته بازها",
    UpdateTime: "بروزرسانی: 15 آبان 1400",
    MainImage: "/src/assets/image/blog/3by2/07.jpg",
    ReadingTime: "4 دقیقه زمان مطالعه",
    Content:
      '<p><span class=\'dropcap bg-success bg-opacity-10 text-success px-2 rounded\'>S</span> مداد رنگی ها مشغول بودند به جز مداد سفید، هیچکس به او کار نمیداد، همه میگفتند : تو به هیچ دردی نمیخوری، یک شب که مداد رنگی ها تو سیاهی شب گم شده بودند، مداد سفید تا صبح ماه کشید مهتاب کشید و انقدر ستاره کشید که کوچک و کوچکتر شد صبح توی جعبه مداد رنگی جای خالی او با هیچ رنگی پر نشد، به یاد هم باشیم شاید فردا ما هم در کنار هم نباشیم… </p><p>لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد.</p><p>لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد <u> می\u200cتوانند در خارج از وطن خود زندگی نمایند.</u> مداد رنگی ها مشغول بودند به جز مداد سفید، هیچکس به او کار نمیداد، همه میگفتند : تو به هیچ دردی نمیخوری، یک شب که مداد رنگی ها تو سیاهی شب گم شده بودند، مداد سفید تا صبح ماه کشید مهتاب کشید و انقدر ستاره کشید که کوچک و کوچکتر شد صبح توی جعبه مداد رنگی جای خالی او با هیچ رنگی پر نشد، به یاد هم باشیم شاید فردا ما هم در کنار هم نباشیم… </p><p>لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد. </p><div class=\'text-center h5 mb-4\'>. . .</div><p>هر نفسی که فرو می\u200c بریم، مرگی را که مدام به ما دست\u200c اندازی می\u200cکند پس می\u200cزند... در نهایت این مرگ است که باید پیروز شود، زیرا از هنگام تولد بخشی از سرنوشت ما شده و فقط مدت کوتاهی پیش از بلعیدن طعمه اش، با آن بازی می کند. با این همه، ما تا آنجا که ممکن است، با علاقه فراوان و دلواپسی زیاد به زندگی ادامه می دهیم، همان\u200c طور که تا آنجا که ممکن است طولانی\u200c تر در یک حباب صابون می\u200c دمیم تا بزرگتر شود، گر چه با قطعیتی تمام می\u200c دانیم که خواهد ترکید.</p><h3 class=\\"mt-4\\">شعار مولد در مورد تجارت</h3><div class=\\"row mb-4\\">  <div class=\\"col-md-6\\">    <p>چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت.</p>  </div>  <div class=\\"col-md-6\\">    <p>برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.</p>  </div></div><p>کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.</p><p>لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. </p><h3>سیستم دوربین حرفه ای همه کاره </h3><p>این راست نیست که هرچه عاشق\u200c تر باشی بهتر درک می\u200cکنی. همه\u200cی آنچه عشق و عاشقی از من می\u200c خواهد فقط درکِ این حکمت است: دیگری نشناختنی است؛ ماتیِ او پرده\u200cی ابهامی به روی یک راز نیست، بل گواهی است که در آن بازیِ بود و نمود هیچ\u200c جایی ندارد. پس من در مسرتِ عشق ورزیدن به یک ناشناس غرق می\u200cشوم، کسی که تا ابد ناشناس خواهد ماند. سِیری عارفانه: من آن\u200cچه را نمی\u200cشناسم می\u200cشناسم...!</p><div class=\\"text-center h5 mb-4\\">. . .</div><h3>طراحی جدید و فن آوری های نوآورانه نمایشگر </h3><p>این یک نوشته آزمایشی است که به طراحان و برنامه نویسان کمک میکند تا این عزیزان با بهره گیری از این نوشته تستی و آزمایشی بتوانند نمونه تکمیل شده از پروژه و طرح خودشان را به کارفرما نمایش دهند، استفاده از این متن تستی می تواند سرعت پیشرفت پروژه را افزایش دهد، و طراحان به جای تایپ و نگارش متن می توانند تنها با یک کپی و پست این متن را در کادرهای مختلف جایگزین نمائید. این نوشته توسط سایت لورم ایپسوم فارسی نگاشته شده است.</p>',
  };

  const ArtistData = {
    Id: 1,
    Name: "فرزانه مرادی",
    Role: "نقاش برتر سال 2024",
    Description:
      "فرزانه مرادی سردبیر ارشد این وبلاگ است و همچنین اخبار فوری مستقر در لندن را گزارش می دهد. او از سال 2015 درباره دولت، عدالت کیفری و نقش پول در سیاست نوشته است.",
  };

  return (
    <section>
      <div className="container position-relative">
        <div className="row">
          {/* =====| Main Content |===== */}
          <div className="col-lg-8 mb-5">
            <a
              href="#"
              className="badge bg-danger bg-opacity-10 text-danger mb-2"
            >
              <i className="fas fa-circle me-2 small fw-bold"></i>ویدئو
            </a>
            <span className="ms-2 mx-2 small">{PostData.UpdateTime}</span>
            {"|"}
            <span className="ms-2 small">{PostData.ReadingTime}</span>
            <h1 className="display-6">{PostData.Title}</h1>

            <div className="ratio ratio-16x9 overflow-hidden rounded my-4">
              <div className="player-wrapper rounded overflow-hidden">
                <img src={PostData.MainImage} alt="" />
              </div>
            </div>

            <div dangerouslySetInnerHTML={{ __html: PostData.Content }}></div>
          </div>
          {/* =====| End of Main Content |===== */}

          {/* =====| Right sidebar |===== */}
          <div className="col-lg-4">
            <div className="sticky-top t-5 z-1">
              <div className="bg-light rounded p-3 p-md-4">
                <div className="d-flex mb-3">
                  <Link
                    className="flex-shrink-0"
                    to={"/Artist-Profile/" + ArtistData.Name}
                  >
                    <div className="avatar avatar-xl border border-4 border-danger rounded-circle">
                      <img
                        className="avatar-img rounded-circle"
                        src="/src/assets/image/avatar/05.jpg"
                        alt="avatar"
                      />
                    </div>
                  </Link>
                  <div className="flex-grow-1 ms-3">
                    <span>سلام</span>
                    <h3 className="mb-0">{ArtistData.Name}</h3>
                    <p>{ArtistData.Role}</p>
                  </div>
                </div>
                <p>{ArtistData.Description}</p>
                <Link
                  to={"/Artist-Profile/" + ArtistData.Name}
                  className="btn btn-danger-soft btn-sm"
                >
                  مشاهده پروفایل
                </Link>
              </div>
            </div>
          </div>
          {/* =====| End of Right sidebar |===== */}
        </div>
      </div>
    </section>
  );
};

export default PostContent;
